{
	"@metadata": {
		"authors": [
			"Flow",
			"Metalhead64",
			"Das Schäfchen",
			"Dan-yell"
		]
	},
	"Games.name": "Blockly-Spiele",
	"Games.puzzle": "Puzzle",
	"Games.maze": "Labyrinth",
	"Games.bird": "Vogel",
	"Games.turtle": "Schildkröte",
	"Games.movie": "Film",
	"Games.pondBasic": "Teich",
	"Games.pondAdvanced": "JS-Teich",
	"Games.linesOfCode1": "Du hast dieses Level mit 1 Zeile JavaScript gelöst:",
	"Games.linesOfCode2": "Du hast dieses Level mit %1 Zeilen JavaScript gelöst:",
	"Games.nextLevel": "Bist du bereit für Level %1?",
	"Games.finalLevel": "Bist du bereit für die nächste Herausforderung?",
	"Games.linkTooltip": "Speichern und auf Blöcke verlinken.",
	"Games.runTooltip": "Das geschriebene Programm ausführen",
	"Games.runProgram": "Programm ausführen",
	"Games.resetTooltip": "Stoppt das Programm und setzt das Level zurück.",
	"Games.resetProgram": "Zurücksetzen",
	"Games.help": "Hilfe",
	"Games.dialogOk": "Okay",
	"Games.dialogCancel": "Abbrechen",
	"Games.catLogic": "Logik",
	"Games.catLoops": "Schleifen",
	"Games.catMath": "Mathematik",
	"Games.catText": "Text",
	"Games.catLists": "Listen",
	"Games.catColour": "Farbe",
	"Games.catVariables": "Variablen",
	"Games.catProcedures": "Funktionen",
	"Games.httpRequestError": "Es gab ein Problem mit der Anfrage.",
	"Games.linkAlert": "Teile deine Blöcke mit diesem Link:\n\n%1",
	"Games.hashError": "Leider stimmt „%1“ mit keinem gespeicherten Programm überein.",
	"Games.xmlError": "Deine gespeicherte Datei konnte nicht geladen werden. Vielleicht wurde sie mit einer anderen Blockly-Version erstellt?",
	"Games.listVariable": "Liste",
	"Games.textVariable": "Text",
	"Games.congratulations": "Glückwunsch!",
	"Games.helpAbort": "Dieses Level ist sehr schwierig. Möchtest du es überspringen und zum nächsten Spiel gehen? Du kannst später immer noch zurückkehren.",
	"Index.clear": "Alle deine Lösungen löschen?",
	"Index.subTitle": "Spiele für die Programmierer von morgen.",
	"Index.moreInfo": "Weitere Informationen …",
	"Index.startOver": "Von vorn anfangen?",
	"Index.clearData": "Daten löschen",
	"Puzzle.animal1": "Ente",
	"Puzzle.animal1Trait1": "Federn",
	"Puzzle.animal1Trait2": "Schnabel",
	"Puzzle.animal1HelpUrl": "https://de.wikipedia.org/wiki/Entenvögel",
	"Puzzle.animal2": "Katze",
	"Puzzle.animal2Trait1": "Schnurrhaare",
	"Puzzle.animal2Trait2": "Fell",
	"Puzzle.animal2HelpUrl": "https://de.wikipedia.org/wiki/Hauskatze",
	"Puzzle.animal3": "Biene",
	"Puzzle.animal3Trait1": "Honig",
	"Puzzle.animal3Trait2": "Stachel",
	"Puzzle.animal3HelpUrl": "https://de.wikipedia.org/wiki/Bienen",
	"Puzzle.animal4": "Schnecke",
	"Puzzle.animal4Trait1": "Schale",
	"Puzzle.animal4Trait2": "Schleim",
	"Puzzle.animal4HelpUrl": "https://de.wikipedia.org/wiki/Schnecken",
	"Puzzle.picture": "Bild:",
	"Puzzle.legs": "Beine:",
	"Puzzle.legsChoose": "auswählen …",
	"Puzzle.traits": "Eigenschaften:",
	"Puzzle.error0": "Perfekt! Alle %1 Bausteine sind richtig.",
	"Puzzle.error1": "Fast! Ein Baustein ist falsch.",
	"Puzzle.error2": "%1 Bausteine sind falsch.",
	"Puzzle.tryAgain": "Der hervorgehobene Baustein ist falsch. Versuche es noch einmal.",
	"Puzzle.checkAnswers": "Antworten überprüfen",
	"Puzzle.helpText": "Hänge für jedes Tier (grün) sein Bild an, wähle seine Anzahl der Beine aus und mache einen Stapel mit seinen Eigenschaften.",
	"Maze.moveForward": "vorwärts laufen",
	"Maze.turnLeft": "links abbiegen",
	"Maze.turnRight": "rechts abbiegen",
	"Maze.doCode": "ausführen",
	"Maze.elseCode": "sonst",
	"Maze.helpIfElse": "Wenn-Sonst-Bausteine führen das eine oder das andere aus.",
	"Maze.pathAhead": "wenn Pfad geradeaus ist",
	"Maze.pathLeft": "wenn Pfad nach links ist",
	"Maze.pathRight": "wenn Pfad nach rechts ist",
	"Maze.repeatUntil": "wiederholen bis",
	"Maze.moveForwardTooltip": "Bewegt den Spieler ein Feld vor.",
	"Maze.turnTooltip": "Dreht den Spieler um 90 Grad nach links oder rechts.",
	"Maze.ifTooltip": "Falls es einen Pfad in der angegebenen Richtung gibt, dann einige Aktionen ausführen.",
	"Maze.ifelseTooltip": "Falls es einen Pfad in der angegebenen Richtung gibt, dann den ersten Aktionenbaustein ausführen, anderenfalls den zweiten.",
	"Maze.whileTooltip": "Die beigefügten Aktionen wiederholen, bis das Ziel erreicht wurde.",
	"Maze.capacity0": "Du hast noch %0 Bausteine.",
	"Maze.capacity1": "Du hast noch %1 Baustein.",
	"Maze.capacity2": "Du hast noch %2 Bausteine.",
	"Maze.runTooltip": "Der Spieler macht das, was die Bausteine sagen.",
	"Maze.resetTooltip": "Setzt den Spieler an den Start des Labyrinths zurück.",
	"Maze.helpStack": "Verbinde einige 'laufe vorwärts' Blöcke, um mir zu helfen, das Ziel zu erreichen.",
	"Maze.helpOneTopBlock": "In diesem Level musst du die ganzen Bausteine in dem weißen Arbeitsbereich zusammenstapeln.",
	"Maze.helpRun": "Führe dein Programm aus, um zu sehen, was passiert.",
	"Maze.helpReset": "Dein Programm löst das Labyrinth nicht. Drücke 'Zurücksetzen' und versuche es erneut.",
	"Maze.helpRepeat": "Computer haben begrenzten Speicher. Erreiche das Ende dieses Pfads mit nur zwei Bausteinen. Benutze „Wiederholen“, um einen Baustein mehr als einmal auszuführen.",
	"Maze.helpCapacity": "Du hast für dieses Level alle Bausteine aufgebraucht. Um einen neuen Baustein zu erstellen, musst du zuerst einen vorhandenen Baustein löschen.",
	"Maze.helpRepeatMany": "Sie können mehrere Blöcke innerhalb eines Blocks 'repeat' passen.",
	"Maze.helpSkins": "Wähle deinen Lieblingsspieler vom Menü aus.",
	"Maze.helpIf": "Ein „Wenn“-Baustein macht etwas, falls die Bedingung wahr ist. Versuche links abzubiegen, falls es einen Pfad nach links gibt.",
	"Maze.helpMenu": "Klicke auf %1 im 'Wenn'-Baustein um die Bedingung zu ändern.",
	"Maze.helpWallFollow": "Kannst du dieses komplizierte Labyrinth lösen? Folge der linken Wand. Nur für fortgeschrittene Programmierer!",
	"Bird.noWorm": "hat keinen Wurm",
	"Bird.heading": "Steuerkurs",
	"Bird.noWormTooltip": "Die Bedingung, wenn der Vogel nicht den Wurm bekommen hat.",
	"Bird.headingTooltip": "Bewege dich in die Richtung des angegebenen Winkels: 0 ist nach rechts, 90 ist geradeaus etc.",
	"Bird.positionTooltip": "x und y markieren die Position des Vogels. Wenn x = 0, ist der Vogel in der Nähe der linken Kante, wenn x = 100, ist er in der Nähe der rechten Kante. Wenn y = 0, ist der Vogel unten, wenn y = 100, ist er oben.",
	"Bird.helpHeading": "Ändere den Winkel des Steuerkurses, damit der Vogel den Wurm bekommt und in seinem Nest landet.",
	"Bird.helpHasWorm": "Verwende diesen Block, um in einen Steuerkurs zu gehen, falls du den Wurm hast, oder in einen anderen Steuerkurs, falls du den Wurm nicht hast.",
	"Bird.helpX": "„x“ ist deine aktuelle horizontale Position. Verwende diesen Block, um in einen Steuerkurs zu gehen, falls „x“ weniger ist als eine Zahl oder anderenfalls in einen anderen Steuerkurs.",
	"Bird.helpElse": "Klicke auf das Symbol, um den „if“-Block zu ändern.",
	"Bird.helpElseIf": "Dieses Level benötigt sowohl einen „sonst wenn“- als auch einen „sonst“-Block.",
	"Bird.helpAnd": "Der „and“-Block ist nur wahr, wenn beide Eingaben wahr sind.",
	"Bird.helpMutator": "Zieht einen „sonst“-Block in den „wenn“-Block.",
	"Turtle.moveTooltip": "Bewegt die Schildkröte um den angegebenen Wert vorwärts oder rückwärts.",
	"Turtle.moveForward": "vorwärts bewegen um",
	"Turtle.moveBackward": "rückwärts bewegen um",
	"Turtle.turnTooltip": "Dreht die Schildkröte nach links oder rechts um die angegebene Gradanzahl.",
	"Turtle.turnRight": "nach rechts drehen um",
	"Turtle.turnLeft": "nach links drehen um",
	"Turtle.widthTooltip": "Ändert die Breite des Stiftes.",
	"Turtle.setWidth": "Breite festlegen auf",
	"Turtle.colourTooltip": "Ändert die Farbe des Stiftes.",
	"Turtle.setColour": "ändert die Farbe in",
	"Turtle.penTooltip": "Hebt oder senkt den Stift zum Stoppen oder Starten der Zeichnung.",
	"Turtle.penUp": "Stift nach oben",
	"Turtle.penDown": "Stift nach unten",
	"Turtle.turtleVisibilityTooltip": "Macht die Schildkröte (Kreis und Pfeil) sichtbar oder unsichtbar.",
	"Turtle.hideTurtle": "Schildkröte ausblenden",
	"Turtle.showTurtle": "Schildkröte anzeigen",
	"Turtle.printHelpUrl": "https://de.wikipedia.org/wiki/Buchdruck",
	"Turtle.printTooltip": "Zeichnet Text in der Richtung der Schildkröte bei ihrem Standort.",
	"Turtle.print": "drucken",
	"Turtle.fontHelpUrl": "https://de.wikipedia.org/wiki/Schriftschnitt",
	"Turtle.fontTooltip": "Legt die Schriftart fest, die vom Druck-Baustein verwendet wird.",
	"Turtle.font": "Schriftart",
	"Turtle.fontSize": "Schriftgröße",
	"Turtle.fontNormal": "normal",
	"Turtle.fontBold": "fett",
	"Turtle.fontItalic": "kursiv",
	"Turtle.submitDisabled": "Führt dein Programm aus, bis es stoppt. Dann kannst du deine Zeichnung zur Galerie abschicken.",
	"Turtle.galleryTooltip": "Öffnet die Galerie der Zeichnungen auf Reddit.",
	"Turtle.galleryMsg": "Galerie ansehen",
	"Turtle.submitTooltip": "Deine Zeichnung zu Reddit abschicken.",
	"Turtle.submitMsg": "Zur Galerie abschicken",
	"Turtle.helpUseLoop": "Deine Lösung funktioniert, du kannst es aber besser machen.",
	"Turtle.helpUseLoop3": "Zeichnet die Form mit nur drei Blöcken.",
	"Turtle.helpUseLoop4": "Zeichnet den Stern mit nur vier Blöcken.",
	"Turtle.helpText1": "Erstelle ein Programm, das ein Quadrat zeichnet.",
	"Turtle.helpText2": "Ändere dein Programm, um ein Fünfeck anstatt eines Quadrats zu zeichnen.",
	"Turtle.helpText3a": "Es gibt einen neuen Block, der es dir ermöglicht, die Farbe zu ändern:",
	"Turtle.helpText3b": "Zeichnet einen gelben Stern.",
	"Turtle.helpText4a": "Es gibt einen neuen Block, der es dir ermöglicht, deinen Stift von dem Papier zu heben, wenn du dich bewegst:",
	"Turtle.helpText4b": "Zeichne einen kleinen gelben Stern, dann zeichne darüber eine Linie.",
	"Turtle.helpText5": "Kannst du anstatt eines Sterns vier Sterne, angeordnet in einem Quadrat zeichnen?",
	"Turtle.helpText6": "Zeichne drei gelbe Sterne und eine weiße Linie.",
	"Turtle.helpText7": "Zeichne die Sterne, dann zeichne vier weiße Linien.",
	"Turtle.helpText8": "Zeichne 360 weiße Linien, die wie der Vollmond aussehen.",
	"Turtle.helpText9": "Kannst du einen schwarzen Kreis hinzufügen, dass der Mond eine Sichel bekommt?",
	"Turtle.helpText10": "Zeichne, was du willst. Du hast eine hohe Anzahl neuer Blöcke, die du entdecken kannst. Viel Spaß!",
	"Turtle.helpText10Reddit": "Verwende den Button &quot;Galerie ansehen&quot;, um zu sehen, was andere Menschen gezeichnet haben. Falls du etwas Interessantes gezeichnet hast, verwende den Button &quot;Zur Galerie abschicken&quot;, um sie zu veröffentlichen.",
	"Turtle.helpToolbox": "Wähle eine Kategorie aus, um die Blöcke anzusehen.",
	"Turtle.catTurtle": "Schildkröte",
	"Movie.x": "x",
	"Movie.y": "y",
	"Movie.x1": "Start-x",
	"Movie.y1": "Start-y",
	"Movie.x2": "End-x",
	"Movie.y2": "End-y",
	"Movie.radius": "Radius",
	"Movie.width": "Breite",
	"Movie.height": "Höhe",
	"Movie.circleTooltip": "Zeichnet einen Kreis am angegebenen Ort und mit dem angegebenen Radius.",
	"Movie.circleDraw": "Kreis",
	"Movie.rectTooltip": "Zeichnet ein Rechteck am angegebenen Ort und mit der angegebenen Breite und Höhe.",
	"Movie.rectDraw": "Rechteck",
	"Movie.lineTooltip": "Zeichnet eine Linie von einem Punkt zum anderen mit der angegebenen Breite.",
	"Movie.lineDraw": "Linie",
	"Movie.timeTooltip": "Gibt die aktuelle Zeit in der Animation zurück (0–100).",
	"Movie.colourTooltip": "Ändert die Farbe des Stiftes.",
	"Movie.setColour": "Farbe festlegen auf",
	"Movie.submitDisabled": "Dein Film bewegt sich nicht. Verwende Blöcke, um etwas interessant zu machen. Dann kannst du dein Film zur Galerie abschicken.",
	"Movie.galleryTooltip": "Öffnet die Galerie der Filme auf Reddit.",
	"Movie.galleryMsg": "Galerie ansehen",
	"Movie.submitTooltip": "Dein Film zu Reddit abschicken.",
	"Movie.submitMsg": "Zur Galerie abschicken",
	"Movie.helpText1": "Einfache Formen verwenden, um diese Person zu zeichnen.",
	"Movie.helpText2a": "Dieses Level ist ein Film. Du möchtest einen roten Ball, um durch den Bildschirm zu rollen. Drücke den Wiedergabe-Button, um eine Vorschau anzusehen.",
	"Movie.helpText2b": "Während der Film abgespielt wird, zählt der Wert des „time“-Blocks von 0 bis 100. Wenn der rote Ball bei der horizontalen Position 0 starten und bis 100 gehen soll, sollte dies einfach sein.",
	"Movie.helpText3": "Der „time“-Block zählt von 0 bis 100. Aber dieses Mal soll der rote Ball bei der horizontalen Position 100 starten und bis 0 gehen. Kannst du eine einfache mathematische Formel herausfinden, die die Richtung ändert?",
	"Movie.helpText4": "Benutze was du im vorherigen Level gelernt hast, um vier grüne Bälle zu erstellen, die sich in alle vier Richtungen bewegen.",
	"Movie.helpText5": "Das Bewegen des Mauskopfes ist leicht. Kannst du die mathematische Formel herausarbeiten, dass sich auch die Ohren bewegen?",
	"Movie.helpText6": "Zwei einfache Linien. Finde heraus, was die Linienenden machen.",
	"Movie.helpText7": "Die mathematische Formel für diesen fallenden Ball ist kompliziert. Hier ist die Antwort:",
	"Movie.helpText8": "Verwende den „if“-Block, um rote und blaue Bälle für die erste Hälfte des Films zu zeichnen. Dann zeichne einen grünen Ball für die zweite Hälfte des Films.",
	"Movie.helpText9": "Kannst du einen Ball erstellen, der dem Draht folgt? Der Draht wurde bereits für dich gezeichnet. Sobald du dies kannst, kannst du alles machen.",
	"Movie.helpText10": "Erstelle einen Film über etwas, was du willst. Du hast eine hohe Anzahl neuer Blöcke, die du entdecken kannst. Viel Spaß!",
	"Movie.helpText10Reddit": "Verwende den Button &quot;Galerie ansehen&quot;, um Filme von anderen Menschen anzusehen. Falls du einen interessanten Film erstellt hast, verwende den Button &quot;Zur Galerie abschicken&quot;, um ihn zu veröffentlichen.",
	"Pond.playerName": "Spieler",
	"Pond.targetName": "Ziel",
	"Pond.rabbitName": "Kaninchen",
	"Pond.counterName": "Zähler",
	"Pond.rookName": "Turm",
	"Pond.sniperName": "Scharfschütze",
	"Pond.pendulumName": "Pendel",
	"Pond.scaredName": "Ängstlich",
	"Pond.scanTooltip": "Sucht nach Feinden. Gib eine Richtung an (0–360). Gibt die Entfernung zum nächsten Feind in dieser Richtung zurück. Gibt „Unendlichkeit“ zurück, falls kein Feind gefunden wurde.",
	"Pond.cannonTooltip": "Feuert die Kanone. Gib eine Richtung (0–360) und einen Bereich (0–70) an.",
	"Pond.swimTooltip": "Schwimme vorwärts. Gib eine Richtung an (0–360).",
	"Pond.stopTooltip": "Hört auf zu schwimmen. Der Spieler wird sich bis zum Stopp verlangsamen.",
	"Pond.healthTooltip": "Gibt die aktuelle Gesundheit des Spielers zurück (0 ist tot, 100 ist gesund).",
	"Pond.speedTooltip": "Gibt die aktuelle Geschwindigkeit des Spielers zurück (0 ist angehalten, 100 ist volle Geschwindigkeit).",
	"Pond.locXTooltip": "Gibt die X-Koordinate des Spielers zurück (0 ist die linke, 100 die rechte Kante).",
	"Pond.locYTooltip": "Gibt die Y-Koordinate des Spielers zurück (0 ist die untere, 100 die obere Kante).",
	"Pond.docsTooltip": "Zeigt die Sprachdokumentation an.",
	"Pond.documentation": "Dokumentation",
	"Pond.helpUseScan": "Deine Lösung funktioniert, aber du kannst es besser. Verwende „scan“, um der Kanone zu sagen, wie weit sie schießen soll.",
	"Pond.helpText1": "Verwende den Befehl „cannon“, um das Ziel zu schlagen. Der erste Parameter ist der Winkel, der zweite der Bereich. Finde die richtige Kombination heraus.",
	"Pond.helpText2": "Dieses Ziel braucht mehrere Schläge. Verwende eine „while (true)“-Schleife, um etwas zeitlich unbegrenzt zu machen.",
	"Pond.helpText3a": "Dieser Gegner bewegt sich zurück und vor, was es schwer macht, ihn zu schlagen. Der Ausdruck „scan“ gibt den exakten Bereich des Gegners in der angegebenen Richtung zurück.",
	"Pond.helpText3b": "Dieser Bereich ist genau das, was der Befehl „cannon“ braucht, um exakt abzufeuern.",
	"Pond.helpText4": "Dieser Gegner ist zu weit weg, um die Kanone zu verwenden (sie hat ein Limit von 70 Metern). Verwende stattdessen den Befehl „swim“, um mit dem Schwimmen nach gegenüber zu beginnen und mit dem Gegner zusammenzustoßen.",
	"Pond.helpText5": "Dieser Gegner ist ebenfalls zu weit weg, um die Kanone zu verwenden. Aber du bist zu schwach, um einen Zusammenstoß zu überleben. Schwimme nach gegenüber zum Gegner, derweil ist dein horizontaler Standort weniger als 50. Dann „stop“ und verwende die Kanone.",
	"Pond.helpText6": "Dieser Gegner zieht fort, wenn er geschlagen wird. Schwimm nach gegenüber, falls er außerhalb des Bereichs ist (70 Meter).",
	"Pond.helpText7": "Rabbit läuft zufällig herum. Kannst du es schlagen?",
	"Pond.helpText8": "Rook schlägt zurück! Aber es schaut nur nach Norden, Süden, Osten und Westen.",
	"Pond.helpText9": "Counter sieht in alle Richtungen. Kannst du mit zwei Gegnern gleichzeitig umgehen?",
	"Pond.helpText10": "Sniper versteckt sich in einer Ecke, das nach Zielen sucht. Viel Glück. Ernsthaft."
}
